In [31]:
import pandas as pd
import numpy as np

In [32]:
# concat 
# concat will append to data frames together
# axis = 0 is on top of each other
# axis = 1 is side by side

In [33]:
# merge

df3 = pd.DataFrame([['a', 'b', 'c'], ['d', 'e', 'f'], ['g', 'h', 'i']], columns = ['col1', 'col2', 'col3'])
df3

  col1 col2 col3
0    a    b    c
1    d    e    f
2    g    h    i

In [34]:
df4 = pd.DataFrame([['x', 1, 'i'], ['e', 2, 'f'], ['b', '3', 'e'], ['z', 4, 'h']], columns = ['col2', 'col4', 'col5'])

df4

  col2 col4 col5
0    x    1    i
1    e    2    f
2    b    3    e
3    z    4    h

In [35]:
# merge isn't just pasting them on each other
# you have to merge them on a condition
# like SQL

# common elements
pd.merge(df3, df4, how = 'inner')
# everything
pd.merge(df3, df4, how = 'outer')
# values in left df and add elements from right df
pd.merge(df3, df4, how = 'left')
# same as left but reversed
pd.merge(df3, df4, how = 'right')

  col1 col2 col3 col4 col5
0  NaN    x  NaN    1    i
1    d    e    f    2    f
2    a    b    c    3    e
3  NaN    z  NaN    4    h

In [36]:
# when doing inner, you can specify which columns to check
# combining data with concat will always do it on indexes
# so if you have one starting with id 0 and one starting with 1, it will append incorrectly
pd.merge(df3, df4, how = 'inner', left_on = 'col2', right_on = 'col2')

  col1 col2 col3 col4 col5
0    a    b    c    3    e
1    d    e    f    2    f

In [37]:
### Missing values

In [38]:
# reading in a file with missing values
df = pd.read_csv('missingvaluesfile.csv')

In [39]:
# shows which values are missing (True if missing)
df.isna()
# shows you how many missing per row
df.isna().sum()         # can do it via row/column by using axis
# shows you how many missing total
df.isna().sum().sum()

np.int64(7)

In [ ]:
# IMPORTANT NOTE
# Not all missing values will be nans, they can be represented by something else
# For example, if your missing values are represented as a -1, you can do the following
df['salary'].replace(-1, np.nan)

# It is on you to in the dataset and check how they are represented
# After that you should replace them with nans to use the functions we did earlier

In [ ]:
# Removing rows

# remove all rows that contain a missing value
df.dropna(axis = 0)
# remove all columns that contain a missing value
df.dropna(axis = 1)
# remove all rows that contain a only null values
df.dropna(axis = 0, how = 'all')
# remove all rows that contain a single value, but don't have to specify
df.dropna(axis = 0, how = 'any')

  Unnamed: 0       one       two     three      four
0          a -1.250699 -0.573801  0.705961 -1.015682
2          c -0.860359 -1.313747  0.676174  1.034417
4          e  0.079169  0.029138  0.239183 -0.492039

In [46]:
# Imputation

# replace missing values with something you want
# does not do them in place, have to save them to be 

# replace it with the mean 
df['one'].fillna(df['one'].mean())

# replace it with a specific value
df['one'].fillna(5)

0   -1.250699
1    5.000000
2   -0.860359
3    5.000000
4    0.079169
5   -1.149060
Name: one, dtype: float64

In [48]:
# replace missing values with the closest value using a liner equation
# in the below case, find the average of point above and below
# can do using nearest by finding nearest index
df.interpolate()

/var/folders/kx/58cjbwzx5jjgn5w_sjz3qk0w0000gn/T/ipykernel_88697/2575836639.py:4: FutureWarning: DataFrame.interpolate with object dtype is deprecated and will raise in a future version. Call obj.infer_objects(copy=False) before interpolating instead.
  df.interpolate()

  Unnamed: 0       one       two     three      four
0          a -1.250699 -0.573801  0.705961 -1.015682
1          b -1.055529 -0.217766  0.655179  1.379276
2          c -0.860359 -1.313747  0.676174  1.034417
3          d -0.390595 -0.642305  0.457679  0.271189
4          e  0.079169  0.029138  0.239183 -0.492039
5          f -1.149060  0.029138  0.239183 -0.160499

In [52]:
# filter data
df = pd.read_csv('students.csv')
df

     id    name  age education        department
0   123    Luai   25        BA  computer science
1   331    Ziad   27       MBA              math
2   441    Taha   30        BA              math
3   221    Suha   26        BA         chemistry
4   336  Sandra   27       MBA  computer science
5   333   Suzan   21        BA         economics
6   234    Alan   36       PhD         economics
7   230    Rian   34       PhD         economics
8   243    Hana   20       MBA         economics
9   154    Mike   29       PhD              math
10  199    Alma   31       MBA         chemistry
11  291  Robert   33       PhD         chemistry

In [51]:
df.loc[df.department == 'math']

    id  name  age education department
1  331  Ziad   27       MBA       math
2  441  Taha   30        BA       math
9  154  Mike   29       PhD       math

In [58]:
# select the name of all PHD students in math department

df.loc[(df.department == 'math') & (df.education == 'PhD'), ['name']]

   name
9  Mike

In [60]:
### Grouping

for g in df.groupby('education'):
    print(g)

('BA',     id   name  age education        department
0  123   Luai   25        BA  computer science
2  441   Taha   30        BA              math
3  221   Suha   26        BA         chemistry
5  333  Suzan   21        BA         economics)
('MBA',      id    name  age education        department
1   331    Ziad   27       MBA              math
4   336  Sandra   27       MBA  computer science
8   243    Hana   20       MBA         economics
10  199    Alma   31       MBA         chemistry)
('PhD',      id    name  age education department
6   234    Alan   36       PhD  economics
7   230    Rian   34       PhD  economics
9   154    Mike   29       PhD       math
11  291  Robert   33       PhD  chemistry)

In [61]:
df.groupby('education').size()

education
BA     4
MBA    4
PhD    4
dtype: int64

In [62]:
df[['age', 'education']].groupby('education').mean()

             age
education
BA         25.50
MBA        26.25
PhD        33.00

In [70]:
df = pd.read_csv('tips.csv')

# have to include what you are grouping by in the subset dataframe
df[['total_bill', 'tip', 'size', 'sex']].groupby('sex').mean()

        total_bill       tip      size
sex
Female   18.056897  2.833448  2.459770
Male     20.744076  3.089618  2.630573

In [71]:
# can group by 2 things
# compare male vs female tips every day
df[['total_bill', 'tip', 'size', 'sex', 'day']].groupby(['sex', 'day']).mean()

             total_bill       tip      size
sex    day
Female Fri    14.145556  2.781111  2.111111
       Sat    19.680357  2.801786  2.250000
       Sun    19.872222  3.367222  2.944444
       Thur   16.715312  2.575625  2.468750
Male   Fri    19.857000  2.693000  2.100000
       Sat    20.802542  3.083898  2.644068
       Sun    21.887241  3.220345  2.810345
       Thur   18.714667  2.980333  2.433333

In [ ]:
# can calculate more than 1 stat per column